class Constants {
  static const webLink = 'https://our-w.com/';
  static const vapIdKey = 'BEDxCnm6AT1KRtltm0ps_OrGj_xVOLqJFCD0owQ83qj4p7AuNEXERgeZ6Z6I6T4lE-gLgLBFMn9f2qjpFvbE2uI';
  static final dropdownItems = [
    'أنا أعتقد ان فكرة المشروع ممتازة وستحقق ربح ممتاز',
    'أنا أعتقد ان فكرة المشروع جيدة وستحقق ربح متوسط',
    'أنا أعتقد ان فكرة المشروع سيئة وستسبب خسارة',
    'أنا زبون ومستعد للطلب ارجو من الوكيل تامين الخدمة'
  ];

  static const firstHeading = 'الوكيل المعتمد: المشروع قيد الدراسة';
  static const secondHeading = 'لتواصل والطلب اتصل : المشروع قيد الدراسة';

  static const aboutUS = '''
  يسعدني ويشرفني تقديم نفسي 

انا مطور برامج ومسوق لست محترف لكن هاوي 

يسعدني ويشرفني تقديم فكرة لمشروع لم يتم الخوض فيه بشكل احترتفي . تم مناقشته لكن بشكل تقليدي .. وانا هنا الان لتقديم فكرة للعمل بشكل احترافي .

المشروع . ادخل  سوق الخضار وانت بيبيتك 
المكاسب مضمونة بنسبة 100 بالمئة 
المخاطر اذا سمعت كلامي وطبقته صفر 
نضامي مئة بالمئة
البرنامج موجه لرواد الاعمال والمستثمرين والتجار السعوديين
فكرة المشروع . خليط بين الخدمات الوجستية التوصيل و اسواق الجملة 

في سوق مواقع التواصل الاجتماعي على مختلف المنصات نلاحظ نجاح نموذجين 

فكرة تطبيق او موقع عبقرية جديدة متل سناب شات او فيس بوك اول نزولها السوق اجتاحت مواقع التواصل الاجتماعي

ثانيا افكار مكلفة للغاية متل تطبيقات توصيل الطعام اوبر كريم وغيرها والتي تحتاج ميزانيات بالملايين 

هناك نوع ثالث لم يلتفت اليه احد ومن الممكن ان يكون الاقوى على الاطلاق من النوعيين السابقين اذا تم انجازه بالشكل المطلوب... ما هو .. قواعد البيانات

مثلا بسوق الخضار كيف استفيد 

تم تصميم موقعنا بالشكل التالي .. 
وعملنا يندرج الى قسمين العمل الميداني الوجستي//مهمتك انت /
 والعمل التسويقي /مهمتنا نحن /

ما مطلوب منك ؟

سائق على معرفة بتوصيل والتعامل مع المواقع 
سيارة ديزل لقلة التكلفة
مطلوب منك استئجار غرفة شرط يكون موقعها قريب جدا من سوق الجملة للخضار بمدينتك 
متلا بالرياض بالعماير الي قريبة من سوق العزيزية 

الفكرة بسيطة 
اغراق السوق بحملات اعلانية موجهة للجمهور 
ادارة الحملات من قبلنا وتنضيم وادارة قواعد البيانات 

للمستثمرين الراغبين بالتعاقد معنا سيتم تزيدنا برقم جوال متخصص للعمل وسيتم التعاقد معه كوكيل حصري 
شاهد وتصفح موقعنا 

شاهد البوست التعريفي للطلبات 

يوجد تجربة تلات شهور .. تواصل معنا واتساب لتعرف برنامجنا كامل 
مع بداية الشهر الرابع بتوقع المبيعات اليومية لا تقل عن 
١٣٠٠٠ ريال . يوميا . حرفيا . شهريا شامل المبيعات لا يقل عن ٣٠٠٠٠٠
شرط تسمع كلامي ...
وعليك حساب الباقي 
مدة التعاقد معنا ١٥ شهر ميلادي 
التجربة تلات شهور 

التقدم الطبيعي للمشروع 
التواصل مباشرة باصحاب المشاريع وطلب كميات جملة الجملة الجملة 
امتلاك مشاريع زراعية . والتخصص 
اذا ناسبك تواصل معنا واتساب
0557346096
او يمكنك اضافة رايك ضمن مجتمعنا وتشارك مع الاخرين ... واخبرنا برأيك
  ''';

  static const myEmail = 'nouraldeenalkalab1@gmail.com';
  static const emailLabel = 'ايميل :';
  static const myPhone = '+966557346096';
  static const phoneLabel = 'جوال اتصال واتساب  الرياض :';
  static const nameLabel = 'المدير المخول :';
  static const myName = 'نور الدين القلاب';
  static const myAddress = 'الخيوط الفضية للتجارة العامة سلطنة عمان سجل تجاري رقم 1457665';
}