import 'package:flutter/material.dart';
import 'package:material_design_icons_flutter/material_design_icons_flutter.dart';
import 'package:web_ksa/responsiveness.dart';

import 'home.dart';

class TermsAndConditionsScreen extends StatelessWidget {
  final String termsText =
      '''حقوق الملكية الفكرية مسجلة ولا يحق لاي جهة نسخ اي بيانات خاصة بنا
رقم الشكاوى والدعم الفني
+966557346096

لا يحق للوكيل
لا يحق للوكيل تغير فكرة التطبيق
لا يحق للوكيل المطالبة بحضر او حذف عضو الا اذا
خالف القوانين والانضمة في البلد المستهدف .
لا يحق للوكيل الوصول او المطالبة لقواعد البيانات والتحكم بها
لا يحق للوكيل التاثير على اراء المستخدمين عن طريق المطالبة بحذف بعض الاراء او التعليقات او سب او شتم الا في حال مخالفة قوانين البلد
لا يحق للوكيل ايقاف العمل او الغاء الطلبات او عدم الرد على العملاء دون عذر مقنع ودون اشعار إدارة الموقع او التطبيق بذلك
لا يحق للوكيل قبض اموال من الزبائن مع عدم تقديم الخدمة المطلوبة
لا يحق للوكيل استقبال اموال من زبائن او عملاء لخدمة لا تخص تخصص الموقع او التطبيق
لا يحق للوكيل بيع خدمة تخلف عن التخصص
لا يحق للوكيل تمديد او المطالبة بتمديد فترة الاستثمار
لا يحق للوكيل قبض مبالغ مالية كاش دون تزويد العميل بفاتورة ضريبية او فاتورة حوالة بنك نضامية حسب انضمت الدولة
للوكيل الحق بان يكون وكيلا معتمدا في الموقع الرقمي او التطبيق ولا يحق لادارة التطبيق او الموقع الرقمي ادراج وكيل اخر
يحق لادارة الموقع او التطبيق التعاقد مع وكلاء اخرين لكن بتاسيس مواقع او تطبيقات جديدة وليس بنفس الموقع او التطبيق
ادارة الموقع او التطبيق لا تتحمل اي مسؤليات قانونية او اي نوع من المسؤليات المالية او اي نوع من انواع الالتزامات او اي نوع من انواع المخالفات التي يرتكبها الوكيل
في حال وجود مخالفات سواءا مالية او قانونية او قضائية يحق لادارة التطبيق او الموقع سحب الوكالة مع عدم الالتزام باعادة اي مبالغ للوكيل او اي نوع من انواع التعويضات

في حال وجود مخالفات سواءا مالية او قانونية او قضائية يحق لادارة التطبيق او الموقع التشهير بالوكيل والمتابعة القانونية والمطالبة بتعويضات اذا تاثر الموقع لاي ملاحقات او مطالبات قانونية او مالية او اخلاقية

مع انتهاء فترة التعاقد يحق لادارة التطبيق او الموقع التالي :
الغاء التعاقد مع او بدون ابداء السبب او الرأي
تمديد التعاقد مع او بدون ابداء السبب او الرأي
التعاقد مع وكيل اخر مع او بدن ابداء السبب او الرأي
التصرف بالموقع او التطبيق بعد انتهاء التعاقد كما تشاء ادارة الموقع او التطبيق

لا يحق للوكيل
اقحام الموقع او التطبيق باي محاورات او مناقشات او جدل في مواضيع سياسية
اقحام الموقع او التطبيق باي محاورات او مناقشات او جدل في مواضيع جنسية او غير اخلاقية

لا يحق للوكيل الترويج لمشروع مشابه وسحب عملاء الموقع لتطبيقه الخاص او موقعه اثناء فترة التعاقد
على الوكيل طباعة فواتير جديدة يوضح فيها المشغل والرقم الدعم الفني .. يتم الاتفاق لاحقا ..
في حال خالف الوكيل اي شرط من الشروط يحق لادارة الموقع او التطبيق سحب الوكالة او التشهير وفق قوانين البلد ولا تلتزم بدفع اي تعويضات
الفواتير
اختر شكل فاتورتك لكن الشرط الرئيسي ان تقوم بادراج النص التالي اسفل الفاتورة وبشكل واضح

المشغل العام وحقوق الملكية وللشكاوى وعلاقات المستثمرين والوكلاء تعود لصاحب رقم (966557346096+) ويب سايت ( اضف عنوان الموقع )




حقوق المستهلك او المستخدم
لا يحق للمستخدم الخوض باي مواضيع سياسية او اخلاقية او اي مواضيع مخلة او مخالفة لنضام البلد تحت طائلة المسائلة القانونية
يحق للمستخدم ابداء رأيه او تقديم شكوى بحرية تامة
يحق للمستخدم المطالبة بفاتورة معتمدة مسجل بها عنوان المشغل ورقم التواصل لتقديم الشكاوي
لا تلتزم ادارة الموقع او التطبيق تجاه المستخدم او المستهلك باي غرامات او مخالفات او تعويضات قام به الوكيل .''';

  const TermsAndConditionsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('الشروط و الاحكام'),
        leading: IconButton(
            onPressed: () {
              Navigator.push(
                context,
                MaterialPageRoute(builder: (context) => const HomeScreen()),
              );
            },
            icon: Icon(MdiIcons.arrowLeft)),
      ),
      body: Padding(
        padding: EdgeInsets.all(16.0.r),
        child: SingleChildScrollView(
          child: Row(
            mainAxisAlignment: MainAxisAlignment.center,
            children: [
              Expanded(
                child: Text(
                  termsText,
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 28.0.sp,
                    color: Colors.black87,
                    letterSpacing: 0.5,
                    height: 2.5.h,
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
